#### Terraform Plan ✅ No changes
<details><summary>Show Plan</summary>

```terraform
data.aws_secretsmanager_secret.rds_password: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.bastion.data.aws_ami.amazon_linux_2: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-02fbef0ac861c9274]
data.aws_secretsmanager_secret.rds_password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:993450011441:secret:prod-rds-postgres-password-pwnGi2]
data.aws_secretsmanager_secret_version.rds_password_version: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
data.aws_secretsmanager_secret_version.rds_password_version: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:993450011441:secret:prod-rds-postgres-password-pwnGi2|AWSCURRENT]
module.bastion.data.aws_ami.amazon_linux_2: Read complete after 0s [id=ami-0e6af742d565ff61c]
module.vpc.aws_security_group.lambda: Refreshing state... [id=sg-044f68a80e1af4713]
module.vpc.aws_security_group.bastion: Refreshing state... [id=sg-0bd245916b0754ab4]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-04daaea65dfdfb222]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-012cbd94499798b95]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-09fcbcb992263f92a]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-04da98f45b88f248e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a6c7c920e23958c7]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0a2cda69f88b564bb]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-080906d3c7200d7f9]
module.vpc.aws_db_subnet_group.rds: Refreshing state... [id=tally-db-subnet-group]
module.bastion.aws_instance.bastion: Refreshing state... [id=i-0a63a19278b8300e8]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0127c0e3b8cb3d594]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-02afbd11e95f64136]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-039bbc6b069c8b7f5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c243b6dfb34680c2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bastion.aws_instance.bastion must be replaced
-/+ resource "aws_instance" "bastion" {
      ~ ami                                  = "ami-0b2c0821853f5c7be" -> "ami-0e6af742d565ff61c" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-west-2:993450011441:instance/i-0a63a19278b8300e8" -> (known after apply)
      ~ availability_zone                    = "us-west-2a" -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0a63a19278b8300e8" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0ff846dbb84b9fef5" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-118.us-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.118" -> (known after apply)
      ~ public_dns                           = "ec2-18-236-182-89.us-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.236.182.89" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "prod"
            "Project"     = "tally"
            "Purpose"     = "bastion"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ primary_network_interface (known after apply)
      - primary_network_interface {
          - delete_on_termination = true -> null
          - network_interface_id  = "eni-0ff846dbb84b9fef5" -> null
        }

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0cbf93ef1161e40c3" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.rds.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "tallydb"
      + db_subnet_group_name                  = "tally-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15.14"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + region                                = "us-west-2"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Environment" = "prod"
          + "Project"     = "tally"
          + "Purpose"     = "rds"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "Project"     = "tally"
          + "Purpose"     = "rds"
        }
      + timezone                              = (known after apply)
      + username                              = "tallyadmin"
      + vpc_security_group_ids                = [
          + "sg-0a2cda69f88b564bb",
        ]
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + rds_password_secret_arn  = "arn:aws:secretsmanager:us-west-2:993450011441:secret:prod-rds-postgres-password-pwnGi2"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>